# Тарифный план 24,99 60 минут 30 смс 1024 мб; 
# Каждая доп минута стоит 0,89 руб., каждое доп сообщение –0,59 руб., каждый доп Мб – 0,79 руб.

list = input("Введите значение через пробел(Минуты(мин), СМС(шт), Интернет трафик(Мб))").split()

sum = 24.99
sumMinute = 0.0
if int(list[0]) > 60:
    sumMinute = 0.89 * (int(list[0])-60)
    print(f"начислено за доп минуты: {sumMinute}")

sumSms = 0.0
if int(list[1]) > 30:
    sumSms = 0.59 * (int(list[1])-30)
    print(f"начислено за доп смс: {sumSms}")

sumMb = 0.0
if int(list[2]) > 1024:
    sumMb = 0.79 * (int(list[2])-1024)
    print(f"начислено за доп интернет-трафик: {sumMb}")

print(f"Всего начислено за месяц вам: {(sum + sumMb + sumMinute + sumSms)*1.02:.2f}")